array = [
"すいか","すいか","すいか","ばなな","りんご",
"みかん","ばなな","みかん","ばなな","すいか",
"りんご","いちご","ばなな","りんご","りんご",
"みかん","みかん","りんご","すいか","ばなな",
"いちご","みかん","いちご","りんご","ばなな",
"ばなな","りんご","すいか","みかん","すいか",
"りんご","ばなな","いちご","ばなな","みかん",
"ばなな","いちご","みかん","ばなな","ばなな",
"すいか","りんご","ばなな","いちご","すいか",
"みかん","いちご","いちご","みかん","みかん",
"りんご","りんご","いちご","りんご","すいか",
"すいか","みかん","みかん","いちご","いちご",
"ばなな","いちご","みかん","みかん","すいか",
"すいか","すいか","みかん","ばなな","みかん",
"すいか","すいか","ばなな","みかん","すいか",
"りんご","いちご","すいか","いちご","ばなな",
"いちご","ばなな","みかん","いちご","すいか",
"みかん","みかん","りんご","ばなな","いちご",
"りんご","りんご","りんご","りんご","みかん",
"みかん","いちご","みかん","ばなな","ばなな"
]

 num = "りんごの数は#{array.count("りんご")}"
 puts num

 num = "ばななの数は#{array.count("ばなな")}"
 puts num

 num = "いちごの数は#{array.count("いちご")}"
 puts num

 num = "みかんの数は#{array.count("みかん")}"
 puts num

 num = "すいかの数は#{array.count("すいか")}"
 puts num

 puts array.delete!('いちご')